akagi0422/PIC16F1508-I2C-slave-mode/I2C.c
                        if(CM2CON0bits.C2OUT == 0)
                        {
                            if(PIR1bits.SSP1IF == 1)
                            PIR1bits.SSP1IF = 0;
                            temp = SSP1BUF;
                            if(SSP1STATbits.BF == 0)
                            SSP1BUF = 0x8D;
                            if(SSP1STATbits.BF == 1)
                            SSP1CON1bits.CKP = 1;
                            
                            __delay_ms(1);
                
                            if(ACKSTAT == 0)
                            {
                                if(PIR1bits.SSP1IF == 1)
                                PIR1bits.SSP1IF = 0;
                                SSP1BUF = 0x8D;
                                if(SSP1STATbits.BF == 1)
                                SSP1CON1bits.CKP = 1;
                            }
                            else
                                i = 0;
                
                            __delay_ms(1);
                
                            if(ACKSTAT == 0)
                            {
                                if(PIR1bits.SSP1IF == 1)
                                PIR1bits.SSP1IF = 0;
                                SSP1BUF = 0x8D;
                                if(SSP1STATbits.BF == 1)
                                SSP1CON1bits.CKP = 1;
                            }
                            else
                                i = 0;
                            
                            __delay_ms(1);
                
                            if(ACKSTAT == 0)
                            {
                                if(PIR1bits.SSP1IF == 1)
                                PIR1bits.SSP1IF = 0;
                                SSP1BUF = 0x8D;
                                if(SSP1STATbits.BF == 1)
                                SSP1CON1bits.CKP = 1;
                            }
                            else
                                i = 0;
                        }
                        else if(CM2CON0bits.C2OUT == 1)
                        {
                            if(PIR1bits.SSP1IF == 1)
                            PIR1bits.SSP1IF = 0;
                            temp = SSP1BUF;
                            if(SSP1STATbits.BF == 0)
                            SSP1BUF = 0x84;
                            if(SSP1STATbits.BF == 1)
                            SSP1CON1bits.CKP = 1;
                            
                            __delay_ms(1);
                
                            if(ACKSTAT == 0)
                            {
                                if(PIR1bits.SSP1IF == 1)
                                PIR1bits.SSP1IF = 0;
                                SSP1BUF = 0x84;
                                if(SSP1STATbits.BF == 1)
                                SSP1CON1bits.CKP = 1;
                            }
                            else
                                i = 0;
                
                            __delay_ms(1);
                
                            if(ACKSTAT == 0)
                            {
                                if(PIR1bits.SSP1IF == 1)
                                PIR1bits.SSP1IF = 0;
                                SSP1BUF = 0x84;
                                if(SSP1STATbits.BF == 1)
                                SSP1CON1bits.CKP = 1;
                            }
                            else
                                i = 0;
                            
                            __delay_ms(1);
                
                            if(ACKSTAT == 0)
                            {
                                if(PIR1bits.SSP1IF == 1)
                                PIR1bits.SSP1IF = 0;
                                SSP1BUF = 0x84;
                                if(SSP1STATbits.BF == 1)
                                SSP1CON1bits.CKP = 1;
                            }
                            else
                                i = 0;
                        }
                    }
                    
                    rd_data[0] == 0x00;
                }
                i = 0;
            }
            else
            {
                LATAbits.LATA5=1;//light off
                LATAbits.LATA4=1;//light off
                LATCbits.LATC6=0;
                LATCbits.LATC7=0;
                rd_data[0] == 0x00;
                i = 0;
            }
        }
        else if(PORTCbits.RC3 == 1 && PORTCbits.RC4 == 1)
        {
            if((rd_data[0] == 0x18 && rd_data[1] == 0xE7)||(rd_data[0] == 0x52 && rd_data[1] == 0xAD))
            {
                if(PORTCbits.RC3 != 0 && PORTCbits.RC4 != 0)
                {
                    LATAbits.LATA5=0;//light on
                    LATAbits.LATA4=0;//light on
                    LATCbits.LATC6=1;
                    LATCbits.LATC7=0;
                    
                    if ((SSP1STATbits.S == 1) && (SSP1STATbits.D_nA == 0) && (SSP1STATbits.R_nW == 0) && (SSP1STATbits.BF == 1))          //MASTER ADD WRITE
                   {
                        SSP1CON2bits.ACKDT = 0;
                        if(SSP1IF == 1)
                        SSP1IF = 0;
                        temp = SSP1BUF;
                        if(SSP1STATbits.BF == 0)
                        {
                            i = 0;
                            SSP1CON1bits.CKP = 1; 
                        }
                    }
                   else if ((SSP1STATbits.S == 1) && (SSP1STATbits.D_nA == 1) && (SSP1STATbits.R_nW == 0) && (SSP1STATbits.BF == 1))    // MASTER DATA WRITE can't in
                    {
                        SSP1CON2bits.ACKDT = 0;
                        if(SSP1IF == 1)
                        SSP1IF = 0; 
                        rd_data[i] = SSP1BUF;
                        SSPCON=0x36;//DO NOT TOUCH THIS LINE
                        SSP1IF=0;
                        i = 0;
                    }
                    else if ((1 == SSP1STATbits.S) && (0 == SSP1STATbits.D_nA) && (1 == SSP1STATbits.R_nW) && (SSP1STATbits.BF == 1))        // MASTER ADDRESS READ
                    {
            
                        //SSP1CON1bits.CKP = 0;
            
