akagi0422/PIC16F1508-I2C-slave-mode/I2C.c
                        if(CM2CON0bits.C2OUT == 0)
                        {
                            if(PIR1bits.SSP1IF == 1)
                            PIR1bits.SSP1IF = 0;
                            temp = SSP1BUF;
                            if(SSP1STATbits.BF == 0)
                            SSP1BUF = 0x8D;
                            if(SSP1STATbits.BF == 1)
                            SSP1CON1bits.CKP = 1;
                            i = 0;
                        }
                        else if(CM2CON0bits.C2OUT == 1)
                        {
                            if(PIR1bits.SSP1IF == 1)
                            PIR1bits.SSP1IF = 0;
                            temp = SSP1BUF;
                            if(SSP1STATbits.BF == 0)
                            SSP1BUF = 0x84;
                            if(SSP1STATbits.BF == 1)
                            SSP1CON1bits.CKP = 1;
                            i = 0;
                        }
                    }
                    
                    rd_data[0] == 0x00;
                }
            }
            else
            {
                LATAbits.LATA5=1;//light off
                LATAbits.LATA4=1;//light off
                LATCbits.LATC6=0;
                LATCbits.LATC7=0;
                rd_data[0] == 0x00;
                i = 0;
            }
        }
        else
        {
            LATAbits.LATA5=1;//light off
            LATAbits.LATA4=1;//light off
            LATCbits.LATC6=0;
            LATCbits.LATC7=0;
            rd_data[0] == 0x00;
            i = 0;
        }
    }
}
